
<details><summary>Show Plan</summary>

``` terraform
terraform
module.lambda.null_resource.docker_build: Refreshing state... [id=3495672274288041012]
module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=modl-hello_world]
module.lambda.aws_s3_bucket.b: Refreshing state... [id=modl-test-data]
module.lambda.null_resource.docker_tag: Refreshing state... [id=4315318053029887979]
module.lambda.null_resource.docker_push: Refreshing state... [id=7763556664755917917]
module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/modl-hello-lambda]
module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=modl-hello-lambda]
module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=modl-hello-lambda]
module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::725604423866:policy/modl-hello-lambda-logs]
module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=modl-hello-lambda-logs]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.downloads[0].aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "*.curibio-modl.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.curibio-modl.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "Environment" = "modl"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.downloads[0].aws_acm_certificate_validation.cert will be created
  + resource "aws_acm_certificate_validation" "cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.downloads[0].aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                        = [
          + "downloads.curibio-modl.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "Managed by Terraform"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "website"
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + domain_name = "downloads.curibio-modl.com.s3.amazonaws.com"
          + origin_id   = "website"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.downloads[0].aws_route53_record.a_record will be created
  + resource "aws_route53_record" "a_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "curibio-modl.com"
      + records         = [
          + "216.239.32.21",
          + "216.239.34.21",
          + "216.239.36.21",
          + "216.239.38.21",
        ]
      + ttl             = 3600
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.downloads[0].aws_route53_record.cname will be created
  + resource "aws_route53_record" "cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "downloads.curibio-modl.com"
      + records         = (known after apply)
      + ttl             = 86400
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.downloads[0].aws_route53_record.cname_ssl_verification["*.curibio-modl.com"] will be created
  + resource "aws_route53_record" "cname_ssl_verification" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.downloads[0].aws_route53_record.mx_record will be created
  + resource "aws_route53_record" "mx_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "curibio-modl.com"
      + records         = [
          + "1 ASPMX.L.GOOGLE.COM.",
          + "10 ALT3.ASPMX.L.GOOGLE.COM.",
          + "10 ALT4.ASPMX.L.GOOGLE.COM.",
          + "5 ALT1.ASPMX.L.GOOGLE.COM.",
          + "5 ALT2.ASPMX.L.GOOGLE.COM.",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = (known after apply)
    }

  # module.downloads[0].aws_route53_record.txt_record will be created
  + resource "aws_route53_record" "txt_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "curibio-modl.com"
      + records         = [
          + "google-site-verification=6G3CjRrIZseGdKwXTXBshjzVVPtGtfN0R57aTtioRC4",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # module.downloads[0].aws_route53_zone.main will be created
  + resource "aws_route53_zone" "main" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "curibio-modl.com"
      + name_servers  = (known after apply)
      + zone_id       = (known after apply)
    }

  # module.downloads[0].aws_s3_bucket.downloads will be created
  + resource "aws_s3_bucket" "downloads" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "downloads.curibio-modl.com"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + policy                      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:s3:::downloads.curibio-modl.com/*"
                      + Sid       = "PublicReadGetObject"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "downloads.curibio-modl.com_logs"
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

  # module.downloads[0].aws_s3_bucket.log_bucket will be created
  + resource "aws_s3_bucket" "log_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "curibio-server-access-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

Pusher: @jperson